{
  "title": "About Me",
  "authors": [],
  "creationDate": "10/1/2020",
  "lastModified": "3/1/2021, 4:22:13 PM",
  "components": [
    {
      "type": "quote",
      "name": "open_quote",
      "text": "Building something original is easy. Coming up with an original quote today is not.",
      "src": ""
    },
    {
      "type": "text",
      "name": "part0",
      "content": "Welcome to my website!\n\nMy name is Ming, and I am a software developer who likes to solve challenging problems and build interesting things. I mainly develop for PC environments and have experiences working with the entire web stack. To be more specific, my coding work typically involves: designing and building dynamic frontend UI, building backend APIs that integrate multiple services, building desktop applications with networking capabilities, algorithm optimization for application logic, and the usual amount of testing and debugging. I also have a solid technical background in all kinds of data processing, applied math and physics, which is always helpful when it comes to building complex systems.\n\nGenerally, I am not afraid of diving deeply into unfamiliar technology when I need to solve a particular problem, and I can usually learn very quickly from building things using documentation. Over the next few years, I hope to play an important role in the development of well-received software systems and prove myself as a strong software engineer. My long term goal, however, is to become an expert in AI technology and participate in the development of advanced AI systems.",
      "links": {
        "interests": "internal::0,2"
      },
      "indented": false
    },
    {
      "type": "image",
      "name": "",
      "width": "300",
      "height": "300",
      "src": "resources/Images/Site/photoshot1.png",
      "caption": "Hello there! This is a picture of myself."
    },
    {
      "type": "text",
      "name": "part1",
      "content": "Ever since my childhood, I've had a strong affinity towards science and technology, and academic skills always came very naturally to me. At the age of 14, I moved to the United States with my parents and found my new home in the peaceful suburbs of Pennsylvania. I was grateful for my life experience and was inspired by all the wonderful people I met to devote my skills to the advancement of technological innovation. Even today, my {interests} are primarily driven by the desire to help solving the biggest challenges in our society.\n\nIn college, I studied electrical engineering and physics, where I absorbed all the knowledge I could lay my hands on and built a strong foundation in many technical subjects. For 3 years, I represented my alma mater, University of Pittsburgh, in the the William Putnam competition, the highest level collegiate mathematical contest, scoring in the upper echelon among contestants. Later on, I joined bioengineering lab, where I took a deeper dive into the world of research, learned to work with advanced image processing and computer vision algorithms, and eventually published a first-author research paper in my undergraduate years.",
      "links": {
        "interests": "internal::0,1"
      },
      "indented": false
    },
    {
      "type": "text",
      "name": "part2",
      "content": "For quite a while, I wasn't sure what exactly I wanted to do what I've learned. But the stunning development of AI technology in recent years convinced me that the following decades will be dominated by emergent AI systems, and I do not want to miss the opportunity to jump into the rapidly growing field. So I decided to transition from my original technical background to a more software-focused domain.\n\nOver the past few years, I was able to systematically build up an wide range of {programming skills}. Thanks in part to the abundance of knowledge available on the Internet, I've gained the ability to write efficient algorithms at the CS graduate school level, and acquired a high degree of proficiency in some of the most powerful/popular programming languages. Completing a number of {projects} helped me master many aspects of web technology and become familiar with the workflow of building software from conception to release. I now feel very comfortable to say that I've reached a point where I can effectively fulfill most software developer roles.\n ",
      "links": {
        "programming skills": "internal::0,0",
        "projects": "internal::1"
      },
      "indented": false
    },
    {
      "type": "text",
      "name": "part3",
      "content": "**Final Note:**\n\nThank for reading! I am ~currently~ looking for a position in software engineering, if you are aware of openings and would like to set up an interview, please {contact} me.",
      "links": {
        "contact": "internal::3"
      },
      "indented": false
    }
  ]
}