{
  "title": "About Me",
  "authors": [],
  "creationDate": "10/1/2020",
  "lastModified": "11/11/2020, 6:33:57 PM",
  "components": [
    {
      "type": "quote",
      "name": "intro",
      "text": "This quote block was optional. But I decided to keep it.",
      "src": ""
    },
    {
      "type": "subtitle",
      "name": "journey",
      "text": "The Journey"
    },
    {
      "type": "text",
      "name": "journey",
      "content": "Welcome to my website!\n\nMy name is Ming and I moved to the United States at the age of 14. For a little over a decade, I've resided in the peaceful suburbs of Western Pennsylvania, and was blessed with a cosmopolitan life experience and an amazing education. From multi-storied apartment unit to single-family house with a spacious backyard, my family is a living testament to the American dream, where hard work sometimes leads to prosperity. Next year, I'll finally become eligible for US citizenship! Now that a development I very much look forward to!",
      "links": {},
      "indented": false
    },
    {
      "type": "image",
      "name": "",
      "width": "300",
      "height": "300",
      "src": "resources/Images/Site/photoshot1.png",
      "caption": "Hello there!"
    },
    {
      "type": "text",
      "name": "journey1",
      "content": "Ever since my childhood, I've had a strong affinity towards science and technology, and aspired to devote my skills to the advancement of technological innovation. Even today, my {interests} are primarily driven by the desire to help solving the biggest challenges in our society. In college, I studied electrical engineering and physics, where I absorbed all the knowledge I could lay my hands on and built a strong foundation in various technical subjects. For 3 years, I represented my alma mater, University of Pittsburgh, in the the William Putnam competition, the highest level collegiate mathematical contest in the United States, scoring in the upper echelon among contestants. Later on, I joined bioengineering lab, where I took a deeper dive into the world of programming, learned to work with advanced image processing and computer vision algorithms and published a first-author research paper in my undergraduate years.\n\nIf everything continued its course, I would likely spend my career designing semiconductor chips or telecommunication systems, which I am sure would have been a fulfilling profession. However, an unlikely event happened in 2016, shortly before my graduation, that led to a drastic change in what I decided to pursue.",
      "links": {
        "interests": "internal::0, 1"
      },
      "indented": false
    },
    {
      "type": "subtitle",
      "name": "epiphany",
      "text": "The Epiphany"
    },
    {
      "type": "text",
      "name": "epiphany1",
      "content": "The chart below illustrates the state of AI research in 2012, the year when I first entered college. Back then, so called AI systems were often cleverly engineered search algorithms, advanced statistical models, or expert systems that encoded human knowledge. While some major {changes} were happening silently, to any reasonable observer at the time, the notion of human-level AI systems belong exclusively to the realm of science fiction. ",
      "links": {
        "changes": "internal::2, 1"
      },
      "indented": false
    },
    {
      "type": "image",
      "name": "Game AIs",
      "width": "",
      "height": "",
      "src": "resources/Images/Site/game_ais.png",
      "caption": "An xkcd chart showing the state of game AI in January 2012. In the span of less than a decade, several major breakthroughs in AI research have made the chart outdated."
    },
    {
      "type": "text",
      "name": "ephiphany2",
      "content": "Then in early 2016, a stunning research paper published by the London based startup DeepMind (now  a Google subsidiary) began to circulate in certain communities. It appeared that DeepMind's newest research project, {AlphaGo} had defeated the European champion 5:0 in their internal testing. A few months later, a updated version of AlphaGo defeated Lee Sedol, the holder of eighteen world championship titles, with a score of 4:1 in a public show-match. \nFor those of us who followed the event closely, it was quite a spectacle at the time. I could elaborate extensively on the significance of this event, but in the interest of brevity I will only provide the following summary:\nSolving the ancient board game Go was previously considered to be at least a decade away. The sheer size and complexity of the problem made any brute-force computation approach completely futile. It was long speculated that in order for a computer to beat humans at go, it must possess some intangible human-like qualities such as intuition, strategizing, or self-learning. AlphaGo demonstrated all of these qualities within the narrow domain of Go, and the core technique behind its creation was generalizable to many other problems. In short, this event demonstrated two key facts: 1) that AI research is progressing much faster than even the most optimistic timelines; and 2) human-level AI is much closer than what was previously assumed.\n\nAs an engineer who possessed the necessary background to take a step further and look behind the scenes, I suddenly found yourself staring at an unmistakable signal: the advent of stronger-than-human AI will likely take place during our lifetime. The field of AI research and development has already demonstrated {exponential growth}, and over the coming decades it will prove to be more impactful than the invention of computers or the Internet. I did not want to miss the opportunity to join the field before it is too late.\n\nPost graduation, I decided that it would be appropriate to pursue a career in software, with the eventual goal of becoming an expert in building AI systems.\n",
      "links": {
        "AlphaGo": "https://www.scientificamerican.com/article/how-the-computer-beat-the-go-master/",
        "exponential growth": "https://openai.com/blog/ai-and-compute/"
      },
      "indented": false
    },
    {
      "type": "subtitle",
      "name": "transition",
      "text": "The Transition"
    },
    {
      "type": "text",
      "name": "transition",
      "content": "Transitioning into the field of software was not a trivial pursuit. Fortunately, my solid technical background greatly assisted the process.\n\nOver the past few years, I was able to systematically build up an wide range of {programming skills}. Thanks in part to the abundance of knowledge available on the Internet, I've gained the ability to write the efficient algorithms at the CS graduate school level, acquired a high degree of proficiency in some of the most powerful/popular programming languages. Completing a number of {projects} helped me achieve a master many aspects of web technology and become familiar with the workflow of building software from conception to release. Suffice to say I've finally reached the point where I am now confident that I can fulfill most software developer roles comfortably.\n\nMy hope is that I will not be too late to the party. At the time of this writing, new breakthrough research papers in AI has been published at a relentless pace. {AlphaZero}, a successor project to AlphaGo, demonstrated the ability to achieve superhuman performance in any perfect information board game given only the rules of the game. Classic imperfect information games such as {Poker}, millennial favorite real time strategy games such as {Starcraft} and {Dota2}, all fell to AI agents in rapid succession. New curiosity-based learning algorithm was even able to crack {Montezuma's Revenge}, a game that requires efficient exploration and human-like planning and has long evaded intense research effort.\n\nGiven the rapid progress, there will be other breakthrough developments waiting just over the horizon, ones that need only new engineering/scientific talents to bring them into reality. Unfortunately, it might take another few years before I can firmly establish myself as a top software engineer capable of completing the most daunting projects. As of right now, I cannot wait to kickstart a career in the world of software.",
      "links": {
        "projects": "internal::1",
        "programming skills": "internal::0, 1",
        "AlphaZero": "https://en.wikipedia.org/wiki/AlphaZero",
        "Poker": "https://www.theverge.com/2019/7/11/20690078/ai-poker-pluribus-facebook-cmu-texas-hold-em-six-player-no-limit",
        "Starcraft": "https://deepmind.com/blog/article/alphastar-mastering-real-time-strategy-game-starcraft-ii",
        "Dota2": "https://openai.com/blog/openai-five/",
        "Montezuma's Revenge": "https://openai.com/blog/reinforcement-learning-with-prediction-based-rewards/"
      },
      "indented": false
    },
    {
      "type": "subtitle",
      "name": "closing",
      "text": "Final Note:"
    },
    {
      "type": "text",
      "name": "closing",
      "content": "Thank for reading thus far! I am currently looking for a position in software engineering, if you are aware of openings and would like to set up an interview, please {contact} me.",
      "links": {
        "contact": "internal::3"
      },
      "indented": false
    }
  ]
}