{
  "title": "A Thought Exercise: Exploring a Plausible Sequence of Events That Could Lead to The First Strong AI Agent",
  "authors": [],
  "creationDate": "10/12/2020",
  "lastModified": "10/12/2020, 3:11:29 PM",
  "components": [
    {
      "type": "text",
      "name": "[unnamed]",
      "content": "1. introduction - will are closer to AGI that most people imagine. explain what this blog post is about.\n\n2. build-up phase. all the techniques necessary for producing AGI are invented by researchers from various institutions, often in service of incremental improvement on a narrow task.\n\n3. the epiphany phase. novel results that proves to be sufficiently spooky compel researchers to withhold publication for the first time.\n\n4. the execution phase. research groups feel sufficiently confident that they have all the ingredients to start building the first strong AI agent, and proceed in secrecy.\n\n5. The reap phase. Evaluation of agent performance confirms that the agent is super intelligent. Reactions from key players range from panic to awe. Other movement indicates storms are over the horizons.",
      "links": {},
      "indented": false
    },
    {
      "type": "subtitle",
      "name": "intro",
      "text": "Introduction:"
    },
    {
      "type": "text",
      "name": "intro",
      "content": "The creation of intelligent machines has be a titillating subject, one which traditionally belongs to the realm of science fiction. In recent years, however, the prospects of humanity giving rise to intellects greater than our own have become less distant.\n\nEvery year, important state-of-the-art benchmarks get surpassed. New research papers often reveal stunning results previously thought months or years away, and indeed promising breakthroughs just around the corner.\n\nThe amount of computing power applied to AI research doubles faster than Moore's Law. Brilliant individuals flock to the blossoming field that a critical mass of talents\n\nDeepMind, a London based Google subsidiary, founded by the prodigious Demis Hassabis in 2010 with the explicit goal of solving intelligence and building the first Artificial General Intelligence agent. \nOpenAI, a relatively new non-profit organization, was founded in 2017 to make sure that in case entities like DeepMind succeed in their quest, the outcome will not spell disaster for our civilization.",
      "links": {},
      "indented": false
    }
  ]
}